In [216]:
person = {
     "first" : "Aashish",
     "last" : "Vardhan",
     "email" : "aashishvardhanp@gmail.com"
}

In [217]:
people = {
     "first" : ["Aashish"],
     "last" : ["Vardhan"],
     "email" : ["aashishvardhanp@gmail.com"]
}

In [218]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [219]:
people['email']

['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']

In [220]:
import pandas as pd

In [221]:
df = pd.DataFrame(people)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [222]:
df['email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [223]:
type(df['email'])

pandas.core.series.Series

In [224]:
df.email

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [225]:
df[['email', 'last']]

                     email     last
0  CoreyMSchafer@gmail.com  Schafer
1        JaneDoe@email.com      Doe
2        JohnDoe@email.com      Doe

In [226]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [227]:
df.iloc[1]

first                 Jane
last                   Doe
email    JaneDoe@email.com
Name: 1, dtype: object

In [228]:
df.iloc[[0,1]]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com

In [229]:
df.iloc[[0,1],2]

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
Name: email, dtype: object

In [230]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [231]:
df.loc[0]

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [232]:
df.loc[[0,1]]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com

In [233]:
df.loc[[0,1], 'email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
Name: email, dtype: object

In [234]:
df.loc[[0,1], ['email', 'last']]

                     email     last
0  CoreyMSchafer@gmail.com  Schafer
1        JaneDoe@email.com      Doe

In [235]:
# Video 4 Data

In [236]:
filt_last = (df['last'] == 'Doe')

In [237]:
df[filt_last]

  first last              email
1  Jane  Doe  JaneDoe@email.com
2  John  Doe  JohnDoe@email.com

In [238]:
df.loc[filt_last]

  first last              email
1  Jane  Doe  JaneDoe@email.com
2  John  Doe  JohnDoe@email.com

In [239]:
df.loc[filt_last, 'email']

1    JaneDoe@email.com
2    JohnDoe@email.com
Name: email, dtype: object

In [240]:
filt_lastAndFirst = (df['last'] == 'Doe') & (df['first'] == 'John')

In [241]:
df.loc[filt_lastAndFirst]

  first last              email
2  John  Doe  JohnDoe@email.com

In [242]:
filt_lastOrFirst = (df['last'] == 'Schafer') | (df['first'] == 'John')

In [243]:
df.loc[filt_lastOrFirst, 'email']

0    CoreyMSchafer@gmail.com
2          JohnDoe@email.com
Name: email, dtype: object

In [244]:
df.loc[filt_lastOrFirst, 'email']

0    CoreyMSchafer@gmail.com
2          JohnDoe@email.com
Name: email, dtype: object

In [245]:
df.loc[~filt_lastOrFirst, 'email']

1    JaneDoe@email.com
Name: email, dtype: object

In [246]:
# Video 5

In [247]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [248]:
df.columns = ['first name','last name','email']
df.columns

Index(['first name', 'last name', 'email'], dtype='object')

In [249]:
df

  first name last name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [250]:
df.columns = [x.upper() for x in df.columns]
df

  FIRST NAME LAST NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [251]:
df.columns = df.columns.str.replace(' ', '_')
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [252]:
df.columns = [x.lower() for x in df.columns]

In [253]:
df.rename(columns={'first_name':'first','last_name':'last'}, inplace=True)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [254]:
df.loc[2]

first                 John
last                   Doe
email    JohnDoe@email.com
Name: 2, dtype: object

In [255]:
# For single row or fingle cell updation

In [256]:
df.loc[2] = ['John','Smith','JohnSmith@email.com']
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      JohnSmith@email.com

In [257]:
df.loc[2, ['last','email']] = ['Doe','JohnDoe@email.com']
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [258]:
df.loc[2, 'last'] = 'Smith'
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [259]:
df.at[2, 'last'] = 'Doe'
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [260]:
filt1 = (df['email'] == 'JohnDoe@email.com') 
df[filt1]['last'] = 'Smith'

<ipython-input-260-3d14d3674ed5>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt1]['last'] = 'Smith'

In [261]:
filt1 = (df['email'] == 'JohnDoe@email.com') 
df.loc[filt1, 'last'] = 'Smith'
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [262]:
# For multiple row updation

In [263]:
df['email'] = df['email'].str.lower()
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [264]:
# apply
# map
# applymap
# replace

In [265]:
#apply
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [266]:
def update_email(email):
    return email.upper()

In [267]:
df['email'].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2          JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [268]:
df['email'] = df['email'].apply(update_email)
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John    Smith        JOHNDOE@EMAIL.COM

In [269]:
df['email'] = df['email'].apply(lambda x: x.lower())
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [270]:
df.apply(len) #to check number of rows per column

first    3
last     3
email    3
dtype: int64

In [271]:
df.apply(len, axis='columns') #to check number of columns per row

0    3
1    3
2    3
dtype: int64

In [272]:
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [273]:
df.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [274]:
# applymap

In [275]:
df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     5     17

In [276]:
df.applymap(str.upper)

   first     last                    email
0  COREY  SCHAFER  COREYMSCHAFER@GMAIL.COM
1   JANE      DOE        JANEDOE@EMAIL.COM
2   JOHN    SMITH        JOHNDOE@EMAIL.COM

In [277]:
df.applymap(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john    smith        johndoe@email.com

In [278]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [279]:
# map

In [280]:
df['first'].map({'Corey':'Chris','Jane':'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [281]:
df['first'] = df['first'].replace({'Corey':'Chris','Jane':'Mary'})

In [282]:
df['first'] = df['first'].replace({'Chris':'Corey','Mary':'Jane'})
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [283]:
# Video 6

In [284]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2       John Smith
dtype: object

In [285]:
df['full_name'] = df['first'] + ' ' + df['last']

In [286]:
df

   first     last                    email      full_name
0  Corey  Schafer  coreymschafer@gmail.com  Corey Schafer
1   Jane      Doe        janedoe@email.com       Jane Doe
2   John    Smith        johndoe@email.com     John Smith

In [287]:
df.drop(columns=['first','last'], inplace=True)

In [288]:
df

                     email      full_name
0  coreymschafer@gmail.com  Corey Schafer
1        janedoe@email.com       Jane Doe
2        johndoe@email.com     John Smith

In [289]:
df['full_name'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2       [John, Smith]
Name: full_name, dtype: object

In [290]:
df['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John    Smith

In [291]:
df[['first','last']] = df['full_name'].str.split(' ', expand=True)

In [292]:
df

                     email      full_name  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@email.com       Jane Doe   Jane      Doe
2        johndoe@email.com     John Smith   John    Smith

In [293]:
df.append({'first':'Tony'}, ignore_index=True)

                     email      full_name  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@email.com       Jane Doe   Jane      Doe
2        johndoe@email.com     John Smith   John    Smith
3                      NaN            NaN   Tony      NaN

In [294]:
df

                     email      full_name  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@email.com       Jane Doe   Jane      Doe
2        johndoe@email.com     John Smith   John    Smith

In [295]:
people2 = {
    "first": ['Tony', 'Steve'], 
    "last": ['Doe', 'Doe'], 
    "email": ['Ironman@avengers.com','Captainamerica@avengers.com']
}
df2 = pd.DataFrame(people2)

In [304]:
df2

   first last                        email
0   Tony  Doe         Ironman@avengers.com
1  Steve  Doe  Captainamerica@avengers.com

In [305]:
df

                         email      full_name  first     last
0      coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1            janedoe@email.com       Jane Doe   Jane      Doe
2            johndoe@email.com     John Smith   John    Smith
3         Ironman@avengers.com            NaN   Tony      Doe
4  Captainamerica@avengers.com            NaN  Steve      Doe

In [298]:
# As we didn't pass the column holder for full_name, they are assigned with NaN by default.

In [299]:
df = df.append(df2,ignore_index=True)

In [300]:
df

                         email      full_name  first     last
0      coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1            janedoe@email.com       Jane Doe   Jane      Doe
2            johndoe@email.com     John Smith   John    Smith
3         Ironman@avengers.com            NaN   Tony      Doe
4  Captainamerica@avengers.com            NaN  Steve      Doe

In [301]:
df.drop(index=4)

                     email      full_name  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@email.com       Jane Doe   Jane      Doe
2        johndoe@email.com     John Smith   John    Smith
3     Ironman@avengers.com            NaN   Tony      Doe

In [302]:
df.drop(index=df[df['last'] == 'Doe'].index)

                     email      full_name  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
2        johndoe@email.com     John Smith   John    Smith